---
kind: method
id: M:Autodesk.Revit.DB.Curve.Clone
zh: 曲线
source: html/071f6ca9-f243-4655-924c-7beb881b100f.htm
---
# Autodesk.Revit.DB.Curve.Clone Method

**中文**: 曲线

Returns a copy of this curve.

## Syntax (C#)
```csharp
public Curve Clone()
```

## Returns
A copy of this curve.